----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1           [-1, 16, 32, 32]             432
              ReLU-2           [-1, 16, 32, 32]               0
         GroupNorm-3           [-1, 16, 32, 32]              32
         Dropout2d-4           [-1, 16, 32, 32]               0
            Conv2d-5           [-1, 16, 32, 32]           2,304
              ReLU-6           [-1, 16, 32, 32]               0
         GroupNorm-7           [-1, 16, 32, 32]              32
         Dropout2d-8           [-1, 16, 32, 32]               0
            Conv2d-9           [-1, 10, 32, 32]             160
        MaxPool2d-10           [-1, 10, 16, 16]               0
           Conv2d-11           [-1, 16, 16, 16]           1,440
             ReLU-12           [-1, 16, 16, 16]               0
        GroupNorm-13           [-1, 16, 16, 16]              32
        Dropout2d-14           [-1, 16, 16, 16]               0
           Conv2d-15           [-1, 16, 16, 16]           2,304
             ReLU-16           [-1, 16, 16, 16]               0
        GroupNorm-17           [-1, 16, 16, 16]              32
        Dropout2d-18           [-1, 16, 16, 16]               0
           Conv2d-19           [-1, 32, 16, 16]           4,608
             ReLU-20           [-1, 32, 16, 16]               0
        GroupNorm-21           [-1, 32, 16, 16]              64
        Dropout2d-22           [-1, 32, 16, 16]               0
           Conv2d-23           [-1, 16, 16, 16]             512
        MaxPool2d-24             [-1, 16, 8, 8]               0
           Conv2d-25             [-1, 32, 8, 8]           4,608
             ReLU-26             [-1, 32, 8, 8]               0
        GroupNorm-27             [-1, 32, 8, 8]              64
        Dropout2d-28             [-1, 32, 8, 8]               0
           Conv2d-29             [-1, 32, 8, 8]           9,216
             ReLU-30             [-1, 32, 8, 8]               0
        GroupNorm-31             [-1, 32, 8, 8]              64
        Dropout2d-32             [-1, 32, 8, 8]               0
           Conv2d-33             [-1, 32, 8, 8]           9,216
             ReLU-34             [-1, 32, 8, 8]               0
        GroupNorm-35             [-1, 32, 8, 8]              64
        Dropout2d-36             [-1, 32, 8, 8]               0
        AvgPool2d-37             [-1, 32, 1, 1]               0
           Conv2d-38             [-1, 10, 1, 1]             320
================================================================
Total params: 35,504
Trainable params: 35,504
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.01
Forward/backward pass size (MB): 1.82
Params size (MB): 0.14
Estimated Total Size (MB): 1.97
----------------------------------------------------------------
